; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v6 ?v4)
             (pred_1 ?v12 ?v1)
             (pred_6 ?v6 ?v1)
             (pred_3 ?v2 ?v6 )
	     (pred_8 ?v6)
             (pred_10 ?v3)
             (pred_2 ?v12)
             (pred_7 ?v1)
             (pred_4 ?v6)
             (pred_9 ?v12)
             (pred_5 ?v6)
             (pred_11 ))



(:action op_4
:parameters (?v11 ?v5 ?v8 ?v10)
:precondition (and (pred_10 ?v11) (pred_10 ?v5) (pred_2 ?v8) (pred_7 ?v10)
          (pred_12 ?v11 ?v5) (pred_1 ?v8 ?v10)
                   (pred_6 ?v5 ?v10) (pred_8 ?v11) 
                   (pred_4 ?v5) (pred_9 ?v8))
:effect (and  (pred_5 ?v5) (not (pred_4 ?v5))))


(:action op_1
:parameters (?v11 ?v7)
:precondition (and (pred_10 ?v11) (pred_10 ?v7)
               (pred_8 ?v11) (pred_12 ?v11 ?v7) (pred_5 ?v7))
:effect (and (pred_8 ?v7) (not (pred_8 ?v11))))

(:action op_3
:parameters (?v11 ?v8)
:precondition (and (pred_10 ?v11) (pred_2 ?v8) 
                  (pred_8 ?v11) (pred_3 ?v8 ?v11) (pred_11 ))
:effect (and (pred_9 ?v8)
   (not (pred_3 ?v8 ?v11)) (not (pred_11 ))))


(:action op_2
:parameters (?v11 ?v9 ?v13)
:precondition (and (pred_10 ?v11) (pred_2 ?v9) (pred_2 ?v13)
                  (pred_8 ?v11) (pred_9 ?v13) (pred_3 ?v9 ?v11))
:effect (and (pred_9 ?v9) (pred_3 ?v13 ?v11)
        (not (pred_9 ?v13)) (not (pred_3 ?v9 ?v11))))

(:action op_5
:parameters (?v11 ?v8)
:precondition (and (pred_10 ?v11) (pred_2 ?v8) 
                  (pred_8 ?v11) (pred_9 ?v8))
:effect (and (pred_11 ) (pred_3 ?v8 ?v11) (not (pred_9 ?v8)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_07 obj_13 obj_17 obj_08 obj_04 obj_09 obj_30 obj_26 obj_19 obj_02 obj_03 obj_12 obj_11 obj_01 obj_05 obj_20 obj_28 obj_23 obj_24 obj_06 obj_14 obj_15 obj_16 obj_25
    obj_29 obj_10 obj_22
    obj_18 obj_27 obj_31
    )

    (:init
       (pred_11)

       (pred_10 obj_21)
       (pred_10 obj_07)
       (pred_10 obj_13)
       (pred_10 obj_17)
       (pred_10 obj_08)
       (pred_10 obj_04)
       (pred_10 obj_09)
       (pred_10 obj_30)
       (pred_10 obj_26)
       (pred_10 obj_19)
       (pred_10 obj_02)
       (pred_10 obj_03)
       (pred_10 obj_12)
       (pred_10 obj_11)
       (pred_10 obj_01)
       (pred_10 obj_05)
       (pred_10 obj_20)
       (pred_10 obj_28)
       (pred_10 obj_23)
       (pred_10 obj_24)
       (pred_10 obj_06)
       (pred_10 obj_14)
       (pred_10 obj_15)
       (pred_10 obj_16)
       (pred_10 obj_25)
       (pred_7 obj_29)
       (pred_7 obj_10)
       (pred_7 obj_22)
       (pred_2 obj_18)
       (pred_2 obj_27)
       (pred_2 obj_31)

       (pred_12 obj_21 obj_04)
       (pred_12 obj_21 obj_07)
       (pred_12 obj_07 obj_09)
       (pred_12 obj_07 obj_13)
       (pred_12 obj_07 obj_21)
       (pred_12 obj_13 obj_30)
       (pred_12 obj_13 obj_17)
       (pred_12 obj_13 obj_07)
       (pred_12 obj_17 obj_26)
       (pred_12 obj_17 obj_08)
       (pred_12 obj_17 obj_13)
       (pred_12 obj_08 obj_19)
       (pred_12 obj_08 obj_17)
       (pred_12 obj_04 obj_02)
       (pred_12 obj_04 obj_09)
       (pred_12 obj_04 obj_21)
       (pred_12 obj_09 obj_03)
       (pred_12 obj_09 obj_30)
       (pred_12 obj_09 obj_07)
       (pred_12 obj_09 obj_04)
       (pred_12 obj_30 obj_12)
       (pred_12 obj_30 obj_26)
       (pred_12 obj_30 obj_13)
       (pred_12 obj_30 obj_09)
       (pred_12 obj_26 obj_11)
       (pred_12 obj_26 obj_19)
       (pred_12 obj_26 obj_17)
       (pred_12 obj_26 obj_30)
       (pred_12 obj_19 obj_01)
       (pred_12 obj_19 obj_08)
       (pred_12 obj_19 obj_26)
       (pred_12 obj_02 obj_05)
       (pred_12 obj_02 obj_03)
       (pred_12 obj_02 obj_04)
       (pred_12 obj_03 obj_20)
       (pred_12 obj_03 obj_12)
       (pred_12 obj_03 obj_09)
       (pred_12 obj_03 obj_02)
       (pred_12 obj_12 obj_28)
       (pred_12 obj_12 obj_11)
       (pred_12 obj_12 obj_30)
       (pred_12 obj_12 obj_03)
       (pred_12 obj_11 obj_23)
       (pred_12 obj_11 obj_01)
       (pred_12 obj_11 obj_26)
       (pred_12 obj_11 obj_12)
       (pred_12 obj_01 obj_24)
       (pred_12 obj_01 obj_19)
       (pred_12 obj_01 obj_11)
       (pred_12 obj_05 obj_06)
       (pred_12 obj_05 obj_20)
       (pred_12 obj_05 obj_02)
       (pred_12 obj_20 obj_14)
       (pred_12 obj_20 obj_28)
       (pred_12 obj_20 obj_03)
       (pred_12 obj_20 obj_05)
       (pred_12 obj_28 obj_15)
       (pred_12 obj_28 obj_23)
       (pred_12 obj_28 obj_12)
       (pred_12 obj_28 obj_20)
       (pred_12 obj_23 obj_16)
       (pred_12 obj_23 obj_24)
       (pred_12 obj_23 obj_11)
       (pred_12 obj_23 obj_28)
       (pred_12 obj_24 obj_25)
       (pred_12 obj_24 obj_01)
       (pred_12 obj_24 obj_23)
       (pred_12 obj_06 obj_14)
       (pred_12 obj_06 obj_05)
       (pred_12 obj_14 obj_15)
       (pred_12 obj_14 obj_20)
       (pred_12 obj_14 obj_06)
       (pred_12 obj_15 obj_16)
       (pred_12 obj_15 obj_28)
       (pred_12 obj_15 obj_14)
       (pred_12 obj_16 obj_25)
       (pred_12 obj_16 obj_23)
       (pred_12 obj_16 obj_15)
       (pred_12 obj_25 obj_24)
       (pred_12 obj_25 obj_16)
       (pred_4 obj_11)
       (pred_4 obj_13)
       (pred_4 obj_23)
       (pred_6  obj_11 obj_29)
       (pred_6  obj_13 obj_10)
       (pred_6  obj_23 obj_22)
       (pred_5 obj_21)
       (pred_5 obj_07)
       (pred_5 obj_17)
       (pred_5 obj_08)
       (pred_5 obj_04)
       (pred_5 obj_09)
       (pred_5 obj_30)
       (pred_5 obj_26)
       (pred_5 obj_19)
       (pred_5 obj_02)
       (pred_5 obj_03)
       (pred_5 obj_12)
       (pred_5 obj_01)
       (pred_5 obj_05)
       (pred_5 obj_20)
       (pred_5 obj_28)
       (pred_5 obj_24)
       (pred_5 obj_06)
       (pred_5 obj_14)
       (pred_5 obj_15)
       (pred_5 obj_16)
       (pred_5 obj_25)

       (pred_1  obj_18 obj_29)
       (pred_1  obj_27 obj_10)
       (pred_1  obj_31 obj_22)
       (pred_3 obj_18 obj_07)
       (pred_3 obj_27 obj_04)
       (pred_3 obj_31 obj_05)
       (pred_8 obj_12)
    )

    (:goal (and
       (pred_3 obj_18 obj_28)
       (pred_3 obj_27 obj_14)
    ))
(:constraints
  (always (not (pred_8 obj_09)))
)
)

; plan
1. (op_1 obj_12 obj_03)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_03)
   goals met: 0 of 2
2. (op_1 obj_03 obj_02)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_02)
   goals met: 0 of 2
3. (op_1 obj_02 obj_04)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_04)
   goals met: 0 of 2
4. (op_3 obj_04 obj_27)
   deleted: (pred_3 obj_27 obj_04) (pred_11)
   added: (pred_9 obj_27)
   goals met: 0 of 2
5. (op_1 obj_04 obj_02)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_02)
   goals met: 0 of 2
6. (op_1 obj_02 obj_03)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_03)
   goals met: 0 of 2
7. (op_1 obj_03 obj_20)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_20)
   goals met: 0 of 2
8. (op_1 obj_20 obj_14)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_14)
   goals met: 0 of 2
9. (op_5 obj_14 obj_27)
   deleted: (pred_9 obj_27)
   added: (pred_11) (pred_3 obj_27 obj_14)
   goals met: 1 of 2
10. (op_1 obj_14 obj_20)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_20)
   goals met: 1 of 2
11. (op_1 obj_20 obj_03)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_03)
   goals met: 1 of 2
12. (op_1 obj_03 obj_02)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_02)
   goals met: 1 of 2
13. (op_1 obj_02 obj_04)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_04)
   goals met: 1 of 2
14. (op_1 obj_04 obj_21)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_21)
   goals met: 1 of 2
15. (op_1 obj_21 obj_07)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_07)
   goals met: 1 of 2
16. (op_3 obj_07 obj_18)
   deleted: (pred_3 obj_18 obj_07) (pred_11)
   added: (pred_9 obj_18)
   goals met: 1 of 2
17. (op_1 obj_07 obj_21)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_21)
   goals met: 1 of 2
18. (op_1 obj_21 obj_04)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_04)
   goals met: 1 of 2
19. (op_1 obj_04 obj_02)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_02)
   goals met: 1 of 2
20. (op_1 obj_02 obj_03)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_03)
   goals met: 1 of 2
21. (op_1 obj_03 obj_12)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_12)
   goals met: 1 of 2
22. (op_1 obj_12 obj_28)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_28)
   goals met: 1 of 2
23. (op_5 obj_28 obj_18)
   deleted: (pred_9 obj_18)
   added: (pred_11) (pred_3 obj_18 obj_28)
   goals met: 2 of 2
